# 1.1 Отношение (таблица)

---

## Инициализация БД

[Инструкция](https://towardsdatascience.com/heres-how-to-run-sql-in-jupyter-notebooks-f26eb90f3259)

[Пример](https://github.com/IsFilimonov/LearningPath/blob/main/2021/Stepik_Interactive-SQL-Simulator/Chapter_1a.ipynb)

In [3]:
%load_ext sql
import sqlalchemy
engine = sqlalchemy.create_engine('mysql://user:pass@localhost:3306/stepik')
%sql mysql://user:pass@localhost:3306/stepik

'Connected: user@stepik'

In [4]:
%%sql
SELECT version();

 * mysql://user:***@localhost:3306/stepik
1 rows affected.

[('8.0.27',)]

## Создание базы данных

In [ ]:
%%sql

CREATE DATABASE IF NOT EXISTS stepik;

In [10]:
%%sql
SHOW DATABASES;

 * mysql://user:***@localhost:3306/stepik
7 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('stepik',),
 ('sys',),
 ('world',)]

In [ ]:
sqlalchemy.create_engine('mysql://user:pass@localhost:3306/stepik')
%sql mysql://user:pass@localhost:3306/stepik

## Создание таблицы

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title   VARCHAR(50),
    author  VARCHAR(30),
    price   DECIMAL(8, 2), #
    amount  INT
);

# DECIMAL(8, 2) 
# Десятичное число с 8 цифрами с обеих сторон от запятой и 2 цифрами после неё

In [7]:
%%sql

CREATE TABLE IF NOT EXISTS genre(
    genre_id   INT PRIMARY KEY AUTO_INCREMENT, 
    name_genre VARCHAR(30)
);

 * mysql://user:***@localhost:3306/stepik
0 rows affected.

[]

## Вставка записи в таблицу

In [ ]:
%%sql
INSERT book (title, author, price, amount)
VALUES ('TEST2', 'authDr', 143.535, 4);

In [ ]:
%%sql
INSERT genre (name_genre)
VALUES ('Роман');

Количество полей должно совпадать.  
Код ниже выдаст ошибку:

In [9]:
%%sql
INSERT book (title, author, price, amount)
       VALUES ('TEST2', 'authDr', 143.535);

%%sql
INSERT book (title, author, price)
       VALUES ('TEST2', 'authDr', 143.535, 4);

 * mysql://user:***@localhost:3306/stepik
(MySQLdb._exceptions.OperationalError) (1136, "Column count doesn't match value count at row 1")
[SQL: INSERT book (title, author, price, amount)
       VALUES ('TEST2', 'authDr', 143.535);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql
SELECT * FROM book

In [ ]:
%%sql
SELECT * FROM genre

### Задание

In [ ]:
%%sql
INSERT book (title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);
SELECT * FROM book

In [6]:
%%sql
INSERT INTO book (title, author, price, amount)
          VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
                 ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
                 ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);
SELECT * FROM book

 * mysql://user:***@localhost:3306/stepik
3 rows affected.
12 rows affected.

[(1, 'TEST', 'authr', Decimal('143.50'), 2),
 (2, 'TEST2', 'authDr', Decimal('143.53'), 4),
 (3, 'TEST2', 'authDr', Decimal('143.54'), 4),
 (4, 'TEST2', 'authDr', Decimal('143.54'), 4),
 (5, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (6, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (7, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (8, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (9, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (10, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (11, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (12, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2)]

## Удаление дубликатов

In [8]:
%%sql
DELETE b1 
  FROM book AS b1,
       book AS b2
 WHERE b1.book_id > b2.book_id
   AND b1.title = b2.title;

SELECT * FROM book

 * mysql://user:***@localhost:3306/stepik
0 rows affected.
6 rows affected.

[(1, 'TEST', 'authr', Decimal('143.50'), 2),
 (2, 'TEST2', 'authDr', Decimal('143.53'), 4),
 (5, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (6, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (8, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (9, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2)]